In [2]:
import oracledao as dao

In [3]:
dept = dao.DeptDAO()
dept

In [4]:
d =dept.query_all()
d

<cx_Oracle.Connection to scott@(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=192.168.0.68)(PORT=1521))(CONNECT_DATA=(SERVICE_NAME=orcl)))>

   DEPTNO       DNAME      LOC
0       8         cat   street
1       4      catcat     yyyy
2       4      catcat       go
3       8         cat   street
4       5       hicat     gsat
5       5        hong    korea
6       8         cat   street
7      20    RESEARCH   DALLAS
8      30       SALES  CHICAGO
9      40  OPERATIONS   BOSTON

In [5]:
t1 = ((5,'hotdog','dog'))
t1

(5, 'hotdog', 'dog')

In [6]:
tList = list(t1)
tList

[5, 'hotdog', 'dog']

In [7]:
tList[0],tList[2]= tList[2],tList[0]

In [8]:
tList

['dog', 'hotdog', 5]

In [9]:
t1 = tuple(tList)
t1

('dog', 'hotdog', 5)